Project/Toir/src/Documents/торо_ВнешнееОснованиеДляРабот/торо_ВнешнееОснованиеДляРабот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>торо_ВнешнееОснованиеДляРабот</name>
  <basedOn>Document.торо_АктОВыполненииРегламентногоМероприятия</basedOn>
  <registerRecords>InformationRegister.торо_СтатусыДокументовВнешнихОснованийУстановленные</registerRecords>
  <registerRecords>InformationRegister.торо_Ремонты</registerRecords>
  <registerRecords>InformationRegister.торо_ВнешниеОснованияДляРабот</registerRecords>
  <registerRecords>InformationRegister.торо_СтатусыДокументовВнешнихОснований</registerRecords>
  <registerRecords>InformationRegister.торо_ОперацииВнешнихОснованийДляРабот</registerRecords>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусДокумента</name>
    <type>
      <types>CatalogRef.торо_СтатусыСогласованияДокументовРемонтныхРабот</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособСогласования</name>
    <type>
      <types>CatalogRef.торо_СпособыСогласованияДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.торо_АктОВыполненииРегламентногоМероприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Комиссия</name>
    <type>
      <types>CatalogRef.торо_Комиссии</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОбследованноеОборудование</name>
    <attributes>
      <name>ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбъектРемонта</name>
      <type>
        <types>CatalogRef.торо_ОбъектыРемонта</types>
      </type>
    </attributes>
    <attributes>
      <name>ТиповойДефект</name>
      <type>
        <types>CatalogRef.торо_ТиповыеДефектыОборудования</types>
      </type>
    </attributes>
    <attributes>
      <name>Описание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ПлановаяДатаРемонта</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Исполнитель</name>
      <type>
        <types>CatalogRef.СтруктураПредприятия</types>
      </type>
    </attributes>
    <attributes>
      <name>ГарантийныйРемонт</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>гкс_ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РемонтныеРаботы</name>
    <attributes>
      <name>ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РемонтнаяРабота</name>
      <type>
        <types>CatalogRef.торо_ТехнологическиеОперации</types>
        <types>CatalogRef.торо_ИдентификаторыТехКарт</types>
      </type>
    </attributes>
    <attributes>
      <name>Родитель_ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Предписание_ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Картинка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИсторияСтатусов</name>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗаКого</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатусДокумента</name>
      <type>
        <types>CatalogRef.торо_СтатусыСогласованияДокументовРемонтныхРабот</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Согласующие</name>
    <attributes>
      <name>Согласующий</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Согласовано</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроведениеДокумента</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Порядок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатусДокумента</name>
      <type>
        <types>CatalogRef.торо_СтатусыСогласованияДокументовРемонтныхРабот</types>
      </type>
    </attributes>
    <attributes>
      <name>Замещающий</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Project/Toir/src/InformationRegisters/торо_ВнешниеОснованияДляРабот/торо_ВнешниеОснованияДляРабот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_ВнешниеОснованияДляРабот</name>
  <comment> //TOIR20-370: включенно индексирование для ID и ПлановаяДатаРемонта</comment>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ПлановаяДатаРемонта</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Обработано</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </resources>
  <resources>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </resources>
  <resources>
    <name>гкс_ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <attributes>
    <name>РемонтыОборудования_id</name>
    <comment>Не используется! РемонтыОборудования_ID искать в измерении ID</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ОбъектРемонта</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ID</name>
    <comment>Содержит РемонтыОборудования_ID, несмотря на реквизит</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/InformationRegisters/торо_Ремонты/торо_Ремонты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_Ремонты</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ДатаНачалаПлан</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончанияПлан</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаНачалаФакт</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончанияФакт</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>СпособВыполнения</name>
    <type>
      <types>EnumRef.СпособыСтроительства</types>
    </type>
  </resources>
  <resources>
    <name>ГарантийныйРемонт</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КрайняяДопустимаяДатаЗавершенияРемонта</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <dimensions>
    <name>ID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектРемонта</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
      <types>CatalogRef.торо_СписокОбъектовРегламентногоМероприятия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидРемонта</name>
    <type>
      <types>CatalogRef.торо_ВидыРемонтов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/InformationRegisters/торо_ОперацииВнешнихОснованийДляРабот/торо_ОперацииВнешнихОснованийДляРабот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_ОперацииВнешнихОснованийДляРабот</name>
  <writeMode>RecorderSubordinate</writeMode>
  <dimensions>
    <name>Предписание_ID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>РемонтнаяРабота</name>
    <type>
      <types>CatalogRef.торо_ТехнологическиеОперации</types>
      <types>CatalogRef.торо_ИдентификаторыТехКарт</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Родитель_ID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/Enums/торо_СтатусыДокументов/торо_СтатусыДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>торо_СтатусыДокументов</name>
  <enumValues>
    <name>Зарегистрирован</name>
  </enumValues>
  <enumValues>
    <name>ЗапланированоУстранение</name>
  </enumValues>
  <enumValues>
    <name>Устраняется</name>
  </enumValues>
  <enumValues>
    <name>Устранен</name>
  </enumValues>
  <enumValues>
    <name>Отклонен</name>
  </enumValues>
  <enumValues>
    <name>Выполняется</name>
  </enumValues>
  <enumValues>
    <name>Выполнен</name>
  </enumValues>
  <enumValues>
    <name>ОтказИсполнителя</name>
  </enumValues>
  <enumValues>
    <name>ВозобновленоПослеОтказа</name>
  </enumValues>
  <enumValues>
    <name>Приостановлен</name>
  </enumValues>
  <enumValues>
    <name>ОтказПодразделения</name>
  </enumValues>
  <enumValues>
    <name>гкс_ВыполненНеобходимАктПриемки</name>
  </enumValues>
  <enumValues>
    <name>гкс_Новый</name>
    <comment>TOIR20-673</comment>
  </enumValues>
</mdclass:Enum>

Project/Toir/src/Documents/торо_ВнешнееОснованиеДляРабот/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Перем СтруктураДанных Экспорт; // Содержит структуру данных о статусе документа (Начальный, СогласованиеЗавершено, ПроводитьДокумент, ШаблонСообщенияЭлектроннойПочты) 
										 // из регистра сведений торо_МатрицаПереходаСтатусовДокументов. 
Перем БезусловнаяЗапись Экспорт; // Отключает проверки при записи документа

#Область ОбработчикиСобытий

Процедура ПриКопировании(ОбъектКопирования)
	
	Для каждого ТекСтрока из ОбследованноеОборудование Цикл
		
		МассивОпераций = РемонтныеРаботы.НайтиСтроки(Новый Структура("Предписание_ID", ТекСтрока.ID));
		
		ТекСтрока.ID = Новый УникальныйИдентификатор();
		
		Для каждого Операция Из МассивОпераций Цикл
			Операция.Предписание_ID = ТекСтрока.ID;
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(Основание, СтандартнаяОбработка)
	
	Если ТипЗнч(Основание) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, Основание);
	КонецЕсли;
	
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.торо_АктОВыполненииРегламентногоМероприятия") Тогда
		Организация   = Основание.Организация;
		Подразделение = Основание.Подразделение;
		ДокументОснование = Основание;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ДатаСоздания) И ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
		"НастройкиТОиР", 
		"ПодставлятьТекущуюДатуВоВнешнееОснованиеИВыявленныеДефекты",
		Истина) Тогда
		
		ДатаСоздания = ТекущаяДата();
		
	КонецЕсли;
	
	торо_ЗаполнениеДокументов.ЗаполнитьСтандартныеРеквизитыШапкиПоУмолчанию(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ОбследованноеОборудование.Количество() = 0 Тогда
		ТекстСообщения = НСтр("es='En el documento no es rellenada la parte tabular de la maquinaria inquirida.';ru='В документе не заполнена табличная часть обследованного оборудования.';en='The document does not fill out the tabular part of the inspected equipment.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
		Возврат;
	КонецЕсли;
	
	ПроверитьЗаполнениеТабличнойЧастиОбследованноеОборудование(Отказ);
	ПроверитьЗаполнениеТабличнойЧастиРемонтныеРаботы(Отказ);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	// регистр торо_Предписания
	Движения.торо_ВнешниеОснованияДляРабот.Записывать = Истина;
	Движения.торо_ВнешниеОснованияДляРабот.Очистить();
	
	// регистр торо_Ремонты
	Движения.торо_Ремонты.Записывать = Истина;
	Движения.торо_Ремонты.Очистить();	
	
	Для Каждого ТекСтрокаОбследованноеОборудование Из ОбследованноеОборудование Цикл
		// регистр торо_Предписания
		Движение = Движения.торо_ВнешниеОснованияДляРабот.Добавить();
        Движение.Период                    = Дата;
        Движение.ОбъектРемонта             = ТекСтрокаОбследованноеОборудование.ОбъектРемонта;
        Движение.ID                        = ТекСтрокаОбследованноеОборудование.ID;
        Движение.Описание                  = ТекСтрокаОбследованноеОборудование.Описание;
        Движение.ПлановаяДатаРемонта       = ТекСтрокаОбследованноеОборудование.ПлановаяДатаРемонта;
        Движение.Организация               = Организация;
        Движение.Подразделение             = Подразделение;
		
		// регистр торо_Ремонты
        Движение = Движения.торо_Ремонты.Добавить();
        Движение.Период                    = Дата;
        Движение.ID                        = ТекСтрокаОбследованноеОборудование.ID;
        Движение.ОбъектРемонта             = ТекСтрокаОбследованноеОборудование.ОбъектРемонта;
        Движение.ДатаОкончанияПлан         = ТекСтрокаОбследованноеОборудование.ПлановаяДатаРемонта;
        Движение.ГарантийныйРемонт         = ТекСтрокаОбследованноеОборудование.ГарантийныйРемонт;
		
	КонецЦикла;

	// регистр торо_ОперацииПредписаний
	Движения.торо_ОперацииВнешнихОснованийДляРабот.Записывать = Истина;
	Движения.торо_ОперацииВнешнихОснованийДляРабот.Очистить();
	
	Для Каждого ТекСтрокаРемонтныеРаботы Из РемонтныеРаботы Цикл
		Движение = Движения.торо_ОперацииВнешнихОснованийДляРабот.Добавить();
		Движение.Предписание_ID  = ТекСтрокаРемонтныеРаботы.Предписание_ID;
		Движение.РемонтнаяРабота = ТекСтрокаРемонтныеРаботы.РемонтнаяРабота;
		Движение.ID              = ТекСтрокаРемонтныеРаботы.ID;
		Движение.Родитель_ID     = ТекСтрокаРемонтныеРаботы.Родитель_ID;
		Движение.Количество      = ТекСтрокаРемонтныеРаботы.Количество;
	КонецЦикла;

	Движения.торо_СтатусыДокументовВнешнихОснований.Записывать = Истина;
	торо_РаботаСоСтатусамиДокументовСервер.УстановитьСтатусДокумента(Ссылка, Ссылка, Движения, Перечисления.торо_СтатусыДокументов.Зарегистрирован);
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	МассивIDДляБлокировки = торо_Ремонты.МассивIDДляБлокировкиРемонтовОборудования(Ссылка, ОбследованноеОборудование.ВыгрузитьКолонку("ID"));
	Если МассивIDДляБлокировки <> Неопределено И МассивIDДляБлокировки.Количество() > 0 Тогда
		ТекстСообщения = НСтр("es='¡Es imposible anular la realización del documento, puesto que hay unos documentos pasados, creados a razón sus!';ru='Невозможно отменить проведение документа, так как имеются созданные на его основании проведенные документы!';en='Unable to cancel the document, since there are created documents based on it!'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПроверитьЗаполнениеТабличнойЧастиОбследованноеОборудование(Отказ)
	
	// Укажем, что надо проверить:
	СтруктураОбязательныхПолей = Новый Структура("ОбъектРемонта,ПлановаяДатаРемонта");
	
	// Вызовем общую процедуру проверки.
	торо_ЗаполнениеДокументов.ПроверитьЗаполнениеТабличнойЧасти(ЭтотОбъект, "ОбследованноеОборудование", СтруктураОбязательныхПолей, Отказ, "");
	
КонецПроцедуры

Процедура ПроверитьЗаполнениеТабличнойЧастиРемонтныеРаботы(Отказ)
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	РемонтныеРаботы.Предписание_ID
	|ПОМЕСТИТЬ РемонтныеРаботы
	|ИЗ
	|	&РемонтныеРаботы КАК РемонтныеРаботы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОбследованноеОборудование.НомерСтроки,
	|	ОбследованноеОборудование.ID,
	|	ОбследованноеОборудование.ОбъектРемонта,
	|	ОбследованноеОборудование.ПлановаяДатаРемонта
	|ПОМЕСТИТЬ ОбследованноеОборудование
	|ИЗ
	|	&ОбследованноеОборудование КАК ОбследованноеОборудование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОбследованноеОборудование.НомерСтроки,
	|	ОбследованноеОборудование.ОбъектРемонта
	|ИЗ
	|	ОбследованноеОборудование КАК ОбследованноеОборудование
	|		ЛЕВОЕ СОЕДИНЕНИЕ РемонтныеРаботы КАК РемонтныеРаботы
	|		ПО ОбследованноеОборудование.ID = РемонтныеРаботы.Предписание_ID
	|ГДЕ
	|	РемонтныеРаботы.Предписание_ID ЕСТЬ NULL ");
	Запрос.УстановитьПараметр("ОбследованноеОборудование", ОбследованноеОборудование);
	Запрос.УстановитьПараметр("РемонтныеРаботы", РемонтныеРаботы);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ШаблонСообщения = НСтр("es='Para el objeto de la reparación %1 en la línea %2 no es indicado ni una operación recomendada.';ru='Для объекта ремонта %1 в строке %2 не указано ни одной рекомендуемой операции.';en='For repair object%1, line%2 does not indicate any recommended operations.'");
		ТекстСообщения = СтрШаблон(ШаблонСообщения, Выборка.ОбъектРемонта, Выборка.НомерСтроки);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
	КонецЦикла;
	
КонецПроцедуры

БезусловнаяЗапись = Ложь;

#КонецОбласти

#КонецЕсли
